NFe/wsdl/MS/homologacao/NfeRecepcao2.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.3 (tags/2.3-7528; 2013-04-29T19:34:10+0000) JAXWS-RI/2.2.8 JAXWS/2.2 svn-revision#unknown. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.3 (tags/2.3-7528; 2013-04-29T19:34:10+0000) JAXWS-RI/2.2.8 JAXWS/2.2 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRecepcao2" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRecepcao2" name="NfeRecepcao2">
<types>
<xsd:schema>
<xsd:import namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRecepcao2" schemaLocation="https://homologacao.nfe.ms.gov.br:443/homologacao/services2/NfeRecepcao2?xsd=1"/>
</xsd:schema>
</types>
<message name="nfeRecepcaoLote2">
<part name="nfeDadosMsg" element="tns:nfeDadosMsg"/>
<part name="nfeCabecMsg" element="tns:nfeCabecMsg"/>
</message>
<message name="nfeRecepcaoLote2Response">
<part name="nfeRecepcaoLote2Result" element="tns:nfeRecepcaoLote2Result"/>
<part name="nfeCabecMsg" element="tns:nfeCabecMsg"/>
</message>
<portType name="NfeRecepcao2Soap">
<operation name="nfeRecepcaoLote2" parameterOrder="nfeDadosMsg nfeCabecMsg">
<input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRecepcao2/nfeRecepcaoLote2" message="tns:nfeRecepcaoLote2"/>
<output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRecepcao2/NfeRecepcao2Soap/nfeRecepcaoLote2Response" message="tns:nfeRecepcaoLote2Response"/>
</operation>
</portType>
<binding name="nfeRecepcao2Soap12Binding" type="tns:NfeRecepcao2Soap">
<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="nfeRecepcaoLote2">
<soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRecepcao2/nfeRecepcaoLote2"/>
<input>
<soap12:body use="literal" parts="nfeDadosMsg"/>
<soap12:header message="tns:nfeRecepcaoLote2" part="nfeCabecMsg" use="literal"/>
</input>
<output>
<soap12:body use="literal" parts="nfeRecepcaoLote2Result"/>
<soap12:header message="tns:nfeRecepcaoLote2Response" part="nfeCabecMsg" use="literal"/>
</output>
</operation>
</binding>
<service name="NfeRecepcao2">
<port name="nfeRecepcao2Soap12" binding="tns:nfeRecepcao2Soap12Binding">
<soap12:address location="https://homologacao.nfe.ms.gov.br:443/homologacao/services2/NfeRecepcao2"/>
</port>
</service>
</definitions>